stm32f4.org
#+TITLE: A GCC/CMake Build environment for the STM32F4 Discovery
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./static/worg.css" />
#+options: num:nil

* Intro
This is a quick guide for making a complete build environment for programming the STM32F4 Discovery board. It's going to avoid using any IDEs and will just use the library provided by STM. I will try explain every part of the toolchain but a few files will be copied from the templates STM provides

The directory layout is very simple
#+BEGIN_SRC 
/STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/
 -[..] Files that come from STM
 -CMakLists.txt
/src/
 - main.h
 - main.cpp
-CMakeLists.txt
#+END_SRC
- The ~STM32F4xx_DSP_StdPeriph_Lib_V1.8.0~ is simple downloaded from the STM website and unzipped
- The 2 ~CMakeLists.txt~ will be explained later

* The toolchain
We're going to try to keep things really bare-bones. I'm building using ~arm-none-eabi-gcc~ and it's associated tools. I did this on a Debian system where this version of gcc can be installed from the repository.
The build tool I'm using is CMake.

We tell CMake about our toolchain through the a toolchain file
see: https://cmake.org/cmake/help/v3.6/manual/cmake-toolchains.7.html
#+BEGIN_SRC cmake :tangle toolchain.cmake
  set(CMAKE_SYSTEM_NAME Generic) # 'Generic' is used for embedded systems

  set(CMAKE_C_COMPILER arm-none-eabi-gcc)
  set(CMAKE_CXX_COMPILER arm-none-eabi-g++)
  set(CMAKE_ASM_COMPILER arm-none-eabi-gcc)

  # tells CMake not to try to link executables during its interal checks
  # things are not going to link properly without a linker script
  set(CMAKE_TRY_COMPILE_TARGET_TYPE STATIC_LIBRARY)

  set(CMAKE_OBJCOPY arm-none-eabi-objcopy)
  set(CMAKE_OBJDUMP arm-none-eabi-objdump)
  set(CMAKE_SIZE arm-none-eabi-size)
  set(CMAKE_DEBUGGER arm-none-eabi-gdb)
  set(CMAKE_DEBUGGER arm-none-eabi-gdb)
  set(CMAKE_CPPFILT arm-none-eabi-c++filt)
#+END_SRC
If you skip writing a toolchain file then CMake will default to your system compiler and things will start to slowly go wrong for you

