stm32f4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A GCC/CMake Build environment for the STM32F4 Discovery</title>
<!-- 2017-06-16 Fri 00:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="George Kontsevich" />
<link rel="stylesheet" type="text/css" href="./static/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">A GCC/CMake Build environment for the STM32F4 Discovery</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Intro</a></li>
<li><a href="#sec-2">The toolchain</a></li>
<li><a href="#sec-3">The STM Libraries</a></li>
<li><a href="#sec-4">Building a template/example</a>
<ul>
<li><a href="#sec-4-1">The Startup File</a></li>
<li><a href="#sec-4-2">The Linker Script</a></li>
<li><a href="#sec-4-3">Building with CMake</a></li>
<li><a href="#sec-4-4">Getting it all on the board.. with OpenOCD/GDB</a>
<ul>
<li><a href="#sec-4-4-1">OpenOCD</a></li>
<li><a href="#sec-4-4-2">GDB</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">Other Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a quick guide for making a complete build environment for programming the STM32F4 Discovery board. It's going to avoid using any IDEs and will just use the library provided by STM. I will try explain every part of the toolchain but a few files will be copied from the templates STM provides
</p>

<p>
The directory layout is very simple
</p>
<pre class="example">
/STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/
 -[..] Files that come from STM
 -CMakLists.txt
/src/
 - main.h
 - main.cpp
-CMakeLists.txt
</pre>
<ul class="org-ul">
<li>The <code>STM32F4xx_DSP_StdPeriph_Lib_V1.8.0</code> is simple downloaded from the STM website and unzipped
</li>
<li>The 2 <code>CMakeLists.txt</code> will be explained later
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">The toolchain</h2>
<div class="outline-text-2" id="text-2">
<p>
We're going to try to keep things really bare-bones. I'm building using <code>arm-none-eabi-gcc</code> and it's associated tools. I did this on a Debian system where this version of gcc can be installed from the repository.
The build tool I'm using is CMake.
</p>

<p>
We tell CMake about our toolchain through the a toolchain file
see: <a href="https://cmake.org/cmake/help/v3.6/manual/cmake-toolchains.7.html">https://cmake.org/cmake/help/v3.6/manual/cmake-toolchains.7.html</a>
</p>
<div class="org-src-container">

<pre class="src src-cmake"><span style="color: #0066BB;">set</span>(CMAKE_SYSTEM_NAME Generic) <span style="color: #888888;"># 'Generic' is used for embedded systems</span>

<span style="color: #0066BB;">set</span>(CMAKE_C_COMPILER arm-none-eabi-gcc)
<span style="color: #0066BB;">set</span>(CMAKE_CXX_COMPILER arm-none-eabi-g++)
<span style="color: #0066BB;">set</span>(CMAKE_ASM_COMPILER arm-none-eabi-gcc)

<span style="color: #888888;"># tells CMake not to try to link executables during its interal checks</span>
<span style="color: #888888;"># things are not going to link properly without a linker script</span>
<span style="color: #0066BB;">set</span>(CMAKE_TRY_COMPILE_TARGET_TYPE STATIC_LIBRARY)

<span style="color: #0066BB;">set</span>(CMAKE_OBJCOPY arm-none-eabi-objcopy)
<span style="color: #0066BB;">set</span>(CMAKE_OBJDUMP arm-none-eabi-objdump)
<span style="color: #0066BB;">set</span>(CMAKE_SIZE arm-none-eabi-size)
<span style="color: #0066BB;">set</span>(CMAKE_DEBUGGER arm-none-eabi-gdb)
<span style="color: #0066BB;">set</span>(CMAKE_DEBUGGER arm-none-eabi-gdb)
<span style="color: #0066BB;">set</span>(CMAKE_CPPFILT arm-none-eabi-c++filt)
</pre>
</div>
<p>
If you skip writing a toolchain file then CMake will default to your system compiler and things will start to slowly go wrong for you
</p>
</div>
</div>
