stm32f4.org
* The STM Libraries
To easily write code for this board we will leverage the libraries provided by STM.
The [[https://my.st.com/content/my_st_com/en/products/embedded-software/mcus-embedded-software/stm32-embedded-software/stm32-standard-peripheral-libraries/stsw-stm32065.license%3d1496454354142.html][libraries]] come in two main parts:

- The *CMSIS* ( Cortex Microcontroller Software Interface Standard ) : This library comes from ARM. It's split into several semi-independent components and provides a common base for all ARM devices (independent of vendor). Since we want to get a basic example running, we'll just focus on *CMSIS-CORE*. The other components are related to RTOS/DSP/Debugging and are explained in more detail in the documentation ~STM32F4xx_DSP_StdPeriph_Lib_V1.7.0/Libraries/CMSIS/Documentation/General/html/index.html~ 
 - The core is the interface to the hardware specified by ARM (see ~STM32F4xx_DSP_StdPeriph_Lib_V1.7.0/Libraries/CMSIS/Include/~). In essence this is a header only library. If you look at some of the files you'll see that the functions simply map to one or two lines of ARM assembly. Simple things like "where is the stack pointer?", "add these two numbers", "get a value from this memory address". It allows the developer to omit writing the assembly by hand and to stay in the C/C++ world. All these instructions are standard across ARM chips, so naturally this interface is also standard and portable.

- The *STM32F4xx DSP and Standard Peripherals Library* : This provides the libraries for accessing the peripherals provided by STM. These are different between vendors, so this part is /not/ portable. This part is more or less required b/c your chip needs to communicate to the outside world in one way or another (even if it's crunching pi, you'll need to somehow display the result). You could look up the peripheral registers and do this manually, but the code resulting assembly would still not be portable.

- Finally there is one last file that glues everything together. This is ~stm32f4xx.h~ which lives in ~/STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h~  In short, it specifies (and isolates) all the model specific parameters of the chip you are using. This will affect both libraries so it's sorta what needs to be defined before anything else. Conveniently ~stm32f4xx.h~ will include the CMSIS (/line 817/) and the Peripheral Library (if enabled) itself. So later in our main.h we will just have a:
#+BEGIN_SRC c
  #include "stm32f4.h"
#+END_SRC
and everything will get included

If you look at the opening comment in ~stm32f4xx.h~ you might be a bit confused, but naturally you're *required* to select a device using the preprocessor - otherwise you will get an error on build (/see lines 68-123/). You also need to pass in a value to enable the peripheral library. At the end of ~stm32f4xx.h~ you will see a conditional include
#+BEGIN_SRC c++
  #ifdef USE_STDPERIPH_DRIVER
    #include "stm32f4xx_conf.h"
  #endif /* USE_STDPERIPH_DRIVER */
#+END_SRC
This is the header that actually includes all the peripheral library header available for your device. If you look around for this header you won't find it in the library. STM provides one in:
~STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Project/STM32F4xx_StdPeriph_Templates/~

Why is this file here and not with the others? I'm not really sure. For the sake of simplicity in our build I will add this template directory to the include path, but in a real project maybe you want to create a copy in your source directory.

Now that we have all the pieced, the final step is to write a cmake file that will build the library into a .so file.
#+BEGIN_SRC cmake :tangle STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/CMakeLists.txt
  cmake_minimum_required(VERSION 3.0)
  project(STM32F4xx_DSP_StdPeriph_Lib-for-STM32F40_41xxx VERSION 1.8.0 LANGUAGES C)

  # include the standard library implementation
  set(src 
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_wwdg.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_usart.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_tim.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_syscfg.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_spi.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_spdifrx.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_sdio.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_sai.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_rtc.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_rng.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_rcc.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_qspi.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_pwr.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_ltdc.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_lptim.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_iwdg.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_i2c.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_hash.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_hash_sha1.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_hash_md5.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_gpio.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_fsmc.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_fmpi2c.c
    #Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_fmc.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_flash.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_flash_ramfunc.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_exti.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dsi.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dma2d.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dma.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dfsdm.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dcmi.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dbgmcu.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dac.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cryp.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cryp_tdes.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cryp_des.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cryp_aes.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_crc.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cec.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_can.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_adc.c
    Libraries/STM32F4xx_StdPeriph_Driver/src/misc.c)

  add_library(stm32f4 ${src})

  # set the chip model number
  target_compile_definitions(stm32f4 PUBLIC STM32F40_41xxx)
  # turn on using the peripherals
  target_compile_definitions(stm32f4 PUBLIC USE_STDPERIPH_DRIVER)

  # the chip specific configurations
  target_include_directories(stm32f4 
    PUBLIC
    Libraries/CMSIS/Device/ST/STM32F4xx/Include/)
  # the peripheral configuration file 
  #(again: normally you'd have a copy in your src directory)
  target_include_directories(stm32f4 
    PUBLIC Project/STM32F4xx_StdPeriph_Templates/)
  # the CMSIS interface
  target_include_directories(stm32f4 
    PUBLIC Libraries/CMSIS/Include)
  # the standard library headers
  target_include_directories(stm32f4 
    PUBLIC Libraries/STM32F4xx_StdPeriph_Driver/inc/)

  # The PUBLIC keyword sets these flags to be part of the interface.
  # So any executable that links this library will have to use these flags as well
  target_compile_options(stm32f4 PUBLIC
    -mcpu=cortex-m4 
    -mthumb 
    -mthumb-interwork 
    -mlittle-endian 
    -mfloat-abi=hard 
    -mfpu=fpv4-sp-d16)

#+END_SRC
*Note how one line in the file list is commented out!*
There is a major annoyance that depending on the model you will include different peripherals, which means some peripheral source files will no longer make sense. For example, the ~STM32F40_41xxx~ group of chips' ~stm32f4xx_conf.h~ will not include ~stm32f4xx_fmc.h~ b/c that peripheral is no available on these models. So you will also need to be careful to then go and remove it from this sources list as well. Otherwise this will blow up in a weird and confusing way
(found out how to fix this here: https://sourceforge.net/p/gnuarmeclipse/support-requests/108/)

