stm32f4.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">The STM Libraries</h2>
<div class="outline-text-2" id="text-3">
<p>
To easily write code for this board we will leverage the libraries provided by STM.
The <a href="https://my.st.com/content/my_st_com/en/products/embedded-software/mcus-embedded-software/stm32-embedded-software/stm32-standard-peripheral-libraries/stsw-stm32065.license=1496454354142.html">libraries</a> come in two main parts:
</p>

<ul class="org-ul">
<li>The <b>CMSIS</b> ( Cortex Microcontroller Software Interface Standard ) : This library comes from ARM. It's split into several semi-independent components and provides a common base for all ARM devices (independent of vendor). Since we want to get a basic example running, we'll just focus on <b>CMSIS-CORE</b>. The other components are related to RTOS/DSP/Debugging and are explained in more detail in the documentation <code>STM32F4xx_DSP_StdPeriph_Lib_V1.7.0/Libraries/CMSIS/Documentation/General/html/index.html</code> 
<ul class="org-ul">
<li>The core is the interface to the hardware specified by ARM (see <code>STM32F4xx_DSP_StdPeriph_Lib_V1.7.0/Libraries/CMSIS/Include/</code>). In essence this is a header only library. If you look at some of the files you'll see that the functions simply map to one or two lines of ARM assembly. Simple things like "where is the stack pointer?", "add these two numbers", "get a value from this memory address". It allows the developer to omit writing the assembly by hand and to stay in the C/C++ world. All these instructions are standard across ARM chips, so naturally this interface is also standard and portable.
</li>
</ul>
</li>

<li>The <b>STM32F4xx DSP and Standard Peripherals Library</b> : This provides the libraries for accessing the peripherals provided by STM. These are different between vendors, so this part is <i>not</i> portable. This part is more or less required b/c your chip needs to communicate to the outside world in one way or another (even if it's crunching pi, you'll need to somehow display the result). You could look up the peripheral registers and do this manually, but the code resulting assembly would still not be portable.
</li>

<li>Finally there is one last file that glues everything together. This is <code>stm32f4xx.h</code> which lives in <code>/STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h</code>  In short, it specifies (and isolates) all the model specific parameters of the chip you are using. This will affect both libraries so it's sorta what needs to be defined before anything else. Conveniently <code>stm32f4xx.h</code> will include the CMSIS (<i>line 817</i>) and the Peripheral Library (if enabled) itself. So later in our main.h we will just have a:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #557799;">#include</span> <span style="background-color: #fff0f0;">"stm32f4.h"</span>
</pre>
</div>
<p>
and everything will get included
</p>

<p>
If you look at the opening comment in <code>stm32f4xx.h</code> you might be a bit confused, but naturally you're <b>required</b> to select a device using the preprocessor - otherwise you will get an error on build (<i>see lines 68-123</i>). You also need to pass in a value to enable the peripheral library. At the end of <code>stm32f4xx.h</code> you will see a conditional include
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #557799;">#ifdef</span> USE_STDPERIPH_DRIVER
<span style="color: #557799;">  #include</span> <span style="background-color: #fff0f0;">"stm32f4xx_conf.h"</span>
<span style="color: #557799;">#endif</span> <span style="color: #888888;">/* </span><span style="color: #888888;">USE_STDPERIPH_DRIVER */</span>
</pre>
</div>
<p>
This is the header that actually includes all the peripheral library header available for your device. If you look around for this header you won't find it in the library. STM provides one in:
<code>STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Project/STM32F4xx_StdPeriph_Templates/</code>
</p>

<p>
Why is this file here and not with the others? I'm not really sure. For the sake of simplicity in our build I will add this template directory to the include path, but in a real project maybe you want to create a copy in your source directory.
</p>

<p>
Now that we have all the pieced, the final step is to write a cmake file that will build the library into a .so file.
</p>
<div class="org-src-container">

<pre class="src src-cmake"><span style="color: #0066BB;">cmake_minimum_required</span>(VERSION 3.0)
<span style="color: #0066BB;">project</span>(STM32F4xx_DSP_StdPeriph_Lib-for-STM32F40_41xxx VERSION 1.8.0 LANGUAGES C)

<span style="color: #888888;"># include the standard library implementation</span>
<span style="color: #0066BB;">set</span>(src 
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_wwdg.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_usart.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_tim.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_syscfg.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_spi.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_spdifrx.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_sdio.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_sai.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_rtc.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_rng.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_rcc.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_qspi.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_pwr.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_ltdc.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_lptim.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_iwdg.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_i2c.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_hash.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_hash_sha1.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_hash_md5.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_gpio.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_fsmc.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_fmpi2c.c
  <span style="color: #888888;">#Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_fmc.c</span>
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_flash.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_flash_ramfunc.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_exti.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dsi.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dma2d.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dma.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dfsdm.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dcmi.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dbgmcu.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_dac.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cryp.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cryp_tdes.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cryp_des.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cryp_aes.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_crc.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_cec.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_can.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/stm32f4xx_adc.c
  Libraries/STM32F4xx_StdPeriph_Driver/src/misc.c)

<span style="color: #0066BB;">add_library</span>(stm32f4 ${<span style="color: #996633;">src</span>})

<span style="color: #888888;"># set the chip model number</span>
<span style="color: #0066BB;">target_compile_definitions</span>(stm32f4 PUBLIC STM32F40_41xxx)
<span style="color: #888888;"># turn on using the peripherals</span>
<span style="color: #0066BB;">target_compile_definitions</span>(stm32f4 PUBLIC USE_STDPERIPH_DRIVER)

<span style="color: #888888;"># the chip specific configurations</span>
<span style="color: #0066BB;">target_include_directories</span>(stm32f4 
  PUBLIC
  Libraries/CMSIS/Device/ST/STM32F4xx/Include/)
<span style="color: #888888;"># the peripheral configuration file </span>
<span style="color: #888888;">#(again: normally you'd have a copy in your src directory)</span>
<span style="color: #0066BB;">target_include_directories</span>(stm32f4 
  PUBLIC Project/STM32F4xx_StdPeriph_Templates/)
<span style="color: #888888;"># the CMSIS interface</span>
<span style="color: #0066BB;">target_include_directories</span>(stm32f4 
  PUBLIC Libraries/CMSIS/Include)
<span style="color: #888888;"># the standard library headers</span>
<span style="color: #0066BB;">target_include_directories</span>(stm32f4 
  PUBLIC Libraries/STM32F4xx_StdPeriph_Driver/inc/)

<span style="color: #888888;"># The PUBLIC keyword sets these flags to be part of the interface.</span>
<span style="color: #888888;"># So any executable that links this library will have to use these flags as well</span>
<span style="color: #0066BB;">target_compile_options</span>(stm32f4 PUBLIC
  -mcpu=cortex-m4 
  -mthumb 
  -mthumb-interwork 
  -mlittle-endian 
  -mfloat-abi=hard 
  -mfpu=fpv4-sp-d16)
</pre>
</div>
<p>
<b>Note how one line in the file list is commented out!</b>
There is a major annoyance that depending on the model you will include different peripherals, which means some peripheral source files will no longer make sense. For example, the <code>STM32F40_41xxx</code> group of chips' <code>stm32f4xx_conf.h</code> will not include <code>stm32f4xx_fmc.h</code> b/c that peripheral is no available on these models. So you will also need to be careful to then go and remove it from this sources list as well. Otherwise this will blow up in a weird and confusing way
(found out how to fix this here: <a href="https://sourceforge.net/p/gnuarmeclipse/support-requests/108/">https://sourceforge.net/p/gnuarmeclipse/support-requests/108/</a>)
</p>
</div>
</div>
