stm32f4.org
* Building a template/example 
Now that we have the library built, lets build an example. For simplicity and convenience I recommend just working with the template provided in ~STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Project/STM32F4xx_StdPeriph_Templates/~
We want to copy over the ~main.c~ and ~main.h~ in to our source directory. If you look in to these these templates you will see that they set up some clock "stuff" and GPIO variables - but will otherwise do nothing.
There is a little section labeled ~Add your application code here~ on line 66 where you can start writing your own code.

** The Startup File
This first catch with programming the microcontroller is that you can't simply start at the top of ~main()~. When the chip is powered off, the program is stored permanently in the Flash memory (ROM). Because there is no operating system to loading the program into RAM we need to do that ourselves in addition to initializing system clocks and event handlers.

This process is independent of the actual program itself - so the standard way of doing this is by separating it out into a "startup file". This is generally written in assembly and reused between projects.

STM provides us with examples in 
~/STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Source/Templates~
If you compare the one in ~gcc_ride7/~ and ~arm/~ they're quite different.. I'm not sure why
[[http://www.embedds.com/programming-stm32-discovery-using-gnu-tools-startup-code/][embedds.com]] provides more details on how to write one from scratch if you're interested
For our purposes, we'll just use the one in the ~gcc_ride7/~ directory

Inside the file you can see a ~Reset_Handler~ label which is the actual start point of your program. As the name suggests, this is where the chip will jump to when it gets reset or just powered on.

The way STM has arranged things in these templates is that the startup file sets up the memory and event handler but places system clock configuration in a separate file
~STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Source/Templates/system_stm32f4xx.c~ 
So, in spite of the name, your startup process is actually spread across these two files.
Again, it's not clear to me why it's arranged this way

This clock configuration file can also be generated using STM's wacky Excel spreadsheet
More details are on [[http://thehackerworkshop.com/?p=1138][Matthew Mucker's webpage]]

** The Linker Script
When an application normally runs on a desktop machine it's generally running using virtual memory in a virtual application-specific address space. From the applications point of view it can manipulate it's own memory however it wants - and it's the operating system that then translates that into safe operations on the actually memory (for instance to insure that the applications doesn't touch any memory region it shouldn't)

On a simple microcontroller there is no operating system to manage the memory, and the memory is shared with other functionality. As we saw in the startup script, some addresses are reserved for peripherals, other addresses are for interrupts and reset bits, the stack and heap are allocated some place and there is also a split between ROM and RAM. So we can't just use the default linker and let it do whatever it wants. We need to specify the address space it can use via a linker script

Again, STM provides us with one in ~STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Project/STM32F4xx_StdPeriph_Templates/TrueSTUDIO/STM32F40_41xxx/STM32F417IG_FLASH.ld~ and it's the one we copy over

** Building with CMake
Now that we have all the pieces we can glue it all together with a little CMake

#+BEGIN_SRC cmake :tangle CMakeLists.txt
    cmake_minimum_required(VERSION 3.0)
    enable_language(ASM)

    set(src 
      STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc_ride7/startup_stm32f40_41xxx.s
      STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Source/Templates/system_stm32f4xx.c
      src/main.c)

    add_executable(example.elf ${src})
    target_include_directories( example.elf PRIVATE src/ )

    add_subdirectory(STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/)
    target_link_libraries( example.elf stm32f4 )

    file(COPY 
      ${CMAKE_CURRENT_SOURCE_DIR}/STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Project/STM32F4xx_StdPeriph_Templates/TrueSTUDIO/STM32F40_41xxx/STM32F417IG_FLASH.ld
      DESTINATION
      ${CMAKE_BINARY_DIR})

    set_target_properties(
      example.elf 
      PROPERTIES 
      LINK_FLAGS 
      "-TSTM32F417IG_FLASH.ld \
       -mthumb \
       -mcpu=cortex-m4 \
       -mfloat-abi=hard \
       -mfpu=fpv4-sp-d16 \
       -Wl,--gc-sections")
#+END_SRC
The build flags are inherited from the library we are linking and the link flags are pretty much the same, with the addition of ~-TSTM32F417IG_FLASH.ld~ (the one specifying our linker script)

Now we just run 
#+BEGIN_SRC 
cd some/build/directory
cmake /path/to/CMakeLists.txt
make
#+END_SRC
are we're done!

** Getting it all on the board.. with OpenOCD/GDB

In our build directory we should now see a ~example.elf~ . This is the file we want to get on our micrcontroller

