stm32f4.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Building a template/example</h2>
<div class="outline-text-2" id="text-4">
<p>
Now that we have the library built, lets build an example. For simplicity and convenience I recommend just working with the template provided in <code>STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Project/STM32F4xx_StdPeriph_Templates/</code>
We want to copy over the <code>main.c</code> and <code>main.h</code> in to our source directory. If you look in to these these templates you will see that they set up some clock "stuff" and GPIO variables - but will otherwise do nothing.
There is a little section labeled <code>Add your application code here</code> on line 66 where you can start writing your own code.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">The Startup File</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This first catch with programming the microcontroller is that you can't simply start at the top of <code>main()</code>. When the chip is powered off, the program is stored permanently in the Flash memory (ROM). Because there is no operating system to loading the program into RAM we need to do that ourselves in addition to initializing system clocks and event handlers.
</p>

<p>
This process is independent of the actual program itself - so the standard way of doing this is by separating it out into a "startup file". This is generally written in assembly and reused between projects.
</p>

<p>
STM provides us with examples in 
<code>/STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Source/Templates</code>
If you compare the one in <code>gcc_ride7/</code> and <code>arm/</code> they're quite different.. I'm not sure why
<a href="http://www.embedds.com/programming-stm32-discovery-using-gnu-tools-startup-code/">embedds.com</a> provides more details on how to write one from scratch if you're interested
For our purposes, we'll just use the one in the <code>gcc_ride7/</code> directory
</p>

<p>
Inside the file you can see a <code>Reset_Handler</code> label which is the actual start point of your program. As the name suggests, this is where the chip will jump to when it gets reset or just powered on.
</p>

<p>
The way STM has arranged things in these templates is that the startup file sets up the memory and event handler but places system clock configuration in a separate file
<code>STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Source/Templates/system_stm32f4xx.c</code> 
So, in spite of the name, your startup process is actually spread across these two files.
Again, it's not clear to me why it's arranged this way
</p>

<p>
This clock configuration file can also be generated using STM's wacky Excel spreadsheet
More details are on <a href="http://thehackerworkshop.com/?p=1138">Matthew Mucker's webpage</a>
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">The Linker Script</h3>
<div class="outline-text-3" id="text-4-2">
<p>
When an application normally runs on a desktop machine it's generally running using virtual memory in a virtual application-specific address space. From the applications point of view it can manipulate it's own memory however it wants - and it's the operating system that then translates that into safe operations on the actually memory (for instance to insure that the applications doesn't touch any memory region it shouldn't)
</p>

<p>
On a simple microcontroller there is no operating system to manage the memory, and the memory is shared with other functionality. As we saw in the startup script, some addresses are reserved for peripherals, other addresses are for interrupts and reset bits, the stack and heap are allocated some place and there is also a split between ROM and RAM. So we can't just use the default linker and let it do whatever it wants. We need to specify the address space it can use via a linker script
</p>

<p>
Again, STM provides us with one in <code>STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Project/STM32F4xx_StdPeriph_Templates/TrueSTUDIO/STM32F40_41xxx/STM32F417IG_FLASH.ld</code> and it's the one we copy over
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">Building with CMake</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Now that we have all the pieces we can glue it all together with a little CMake
</p>

<div class="org-src-container">

<pre class="src src-cmake"><span style="color: #0066BB;">cmake_minimum_required</span>(VERSION 3.0)
<span style="color: #0066BB;">enable_language</span>(ASM)

<span style="color: #0066BB;">set</span>(src 
  STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc_ride7/startup_stm32f40_41xxx.s
  STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Libraries/CMSIS/Device/ST/STM32F4xx/Source/Templates/system_stm32f4xx.c
  src/main.c)

<span style="color: #0066BB;">add_executable</span>(example.elf ${<span style="color: #996633;">src</span>})
<span style="color: #0066BB;">target_include_directories</span>( example.elf PRIVATE src/ )

<span style="color: #0066BB;">add_subdirectory</span>(STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/)
<span style="color: #0066BB;">target_link_libraries</span>( example.elf stm32f4 )

<span style="color: #0066BB;">file</span>(COPY 
  ${<span style="color: #996633;">CMAKE_CURRENT_SOURCE_DIR</span>}/STM32F4xx_DSP_StdPeriph_Lib_V1.8.0/Project/STM32F4xx_StdPeriph_Templates/TrueSTUDIO/STM32F40_41xxx/STM32F417IG_FLASH.ld
  DESTINATION
  ${<span style="color: #996633;">CMAKE_BINARY_DIR</span>})

<span style="color: #0066BB;">set_target_properties</span>(
  example.elf 
  PROPERTIES 
  LINK_FLAGS 
  <span style="background-color: #fff0f0;">"-TSTM32F417IG_FLASH.ld \</span>
<span style="background-color: #fff0f0;">   -mthumb \</span>
<span style="background-color: #fff0f0;">   -mcpu=cortex-m4 \</span>
<span style="background-color: #fff0f0;">   -mfloat-abi=hard \</span>
<span style="background-color: #fff0f0;">   -mfpu=fpv4-sp-d16 \</span>
<span style="background-color: #fff0f0;">   -Wl,--gc-sections"</span>)
</pre>
</div>
<p>
The build flags are inherited from the library we are linking and the link flags are pretty much the same, with the addition of <code>-TSTM32F417IG_FLASH.ld</code> (the one specifying our linker script)
</p>

<p>
Now we just run 
</p>
<pre class="example">
cd some/build/directory
cmake /path/to/CMakeLists.txt
make
</pre>
<p>
are we're done!
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">Getting it all on the board.. with OpenOCD/GDB</h3>
<div class="outline-text-3" id="text-4-4">
<p>
In our build directory we should now see a <code>example.elf</code> . This is the file we want to get on our micrcontroller
</p>
</div>
