stm32f4.org
*** OpenOCD
Each development board will generally come with additional hardware for debugging and loading new programs onto the actual chip. On easy-to-use boards such as this one. this chip will talk over USB and will have its own protocols like JTAG and SWD. However, as the user we don't really want to have to deal with these protocols directly, nor do we really want to interact with this helper-chip. 

To handle this mess we have OpenOCD. Once we have it setup, it'll do all the connecting and communicating and in turn OpenOCD will provide us with a GDB server - so interacting with any board is "standardized" to simply interacting with GDB.

Fortunately b/c we're using a very vanilla development board OpenOCD provides some existing configuration files that we can use to quickly get up and running. We just need to point to them from a simple master-config-file which we'll put into our build directory.

Each line is pretty self explanatory
#+BEGIN_SRC :tangle openocd.cfg
# This is an STM32F4 discovery board with a single STM32F407VGT6 chip.
# http://www.st.com/internet/evalboard/product/252419.jsp

source [find interface/stlink-v2.cfg]
transport select hla_swd
source [find target/stm32f4x.cfg]
reset_config srst_only
#+END_SRC

Save this to an ~openocd.cfg~ in our build directory (that's the default file name OpenOCD looks for) and launch openocd as root on a separate console

You'll get something like:
#+BEGIN_SRC 

Open On-Chip Debugger 0.9.0 (2017-03-07-13:28)
Licensed under GNU GPL v2
For bug reports, read
        http://openocd.org/doc/doxygen/bugs.html
Info : The selected transport took over low-level target control. The results might differ compared to plain JTAG/SWD
adapter speed: 2000 kHz
adapter_nsrst_delay: 100
none separate
srst_only separate srst_nogate srst_open_drain connect_deassert_srst
Info : Unable to match requested speed 2000 kHz, using 1800 kHz
Info : Unable to match requested speed 2000 kHz, using 1800 kHz
Info : clock speed 1800 kHz
Info : STLINK v2 JTAG v14 API v2 SWIM v0 VID 0x0483 PID 0x3748
Info : using stlink api v2
Info : Target voltage: 2.895868
Info : stm32f4x.cpu: hardware has 6 breakpoints, 4 watchpoints

#+END_SRC
Though it doesn't spell it out, our GDB server is now running!
From the rest of the text we see that there was some clock issue that got corrected and it connected over JTAG/STLINK. We also learn that this chip has 6 breakpoints and 4 watchpoints (this is something we can tell GDB about later so that it won't allow us to use more than we have)

So now lets connect to it over GDB

*** GDB
In a new console window run
#+BEGIN_SRC 
> arm-none-eabi-gdb example.elf
#+END_SRC
/note: make sure you run the arm version of gdb and not run your system's ~gdb~. The system gdb will not give you any errors at first and it will half work until you start getting strange behavior down the line/

This will load up the ~example.elf~ into the GDB session. To then flash the program onto the board we run a session like this
#+BEGIN_SRC 
$ arm-none-eabi-gdb example.elf
(gdb) target remote localhost:3333
Remote debugging using localhost:3333
...
(gdb) monitor reset halt
...
(gdb) load
Loading section .vectors, size 0x100 lma 0x20000000
Loading section .text, size 0x5a0 lma 0x20000100
Loading section .data, size 0x18 lma 0x200006a0
Start address 0x2000061c, load size 1720
Transfer rate: 22 KB/sec, 573 bytes/write.
(gdb) continue
Continuing.
...
#+END_SRC
(taken from: http://openocd.org/doc/html/GDB-and-OpenOCD.html)
This will:
- connect to the GDB server
- halt the program currently running on the chip
- load our example.elf program into the chip
- let the micro run (with the new program in memory)

and that's it!
We're done

We have our template/example on the board :) You can now take any example from online and our framework should continue to work - as long as it doesn't require other libraries.

* Other Resources
I personally have almost no experience programming microcontrollers, so most of this guide has beenput together by reading-the-manual and a lot of tid-bits from other resources

- Matthiew Mucker has a great series setting up a build environment for the ~STM32F0DISCOVERY~ on Windows using GCC and Eclipse: [[http://thehackerworkshop.com/?p=391][part1]], [[http://thehackerworkshop.com/?p=443][part2]], [[http://thehackerworkshop.com/?p=626][part3]], [[http://thehackerworkshop.com/?p=710][part4]], [[http://thehackerworkshop.com/?p=602][part5]]

- Geoffrey Brown has a great book called [[https://www.cs.indiana.edu/~geobrown/book.pdf][Discovering the STM32 Microcontroller]] which you can get online. He provides his own [[https://github.com/geoffreymbrown/][templates]] using Make and CodeSourcery for the ~STM32 VL Discovery~. This seems like a really great book to start with if you want to really learn about programming ARM micros.

- A more polished CMake/GCC environment is available on [[https://github.com/ObKo/stm32-cmake][github]], thanks to Konstantin Oblaukhov. It pretty much does what I did above, but it's written in a way where you can select your model number and cmake will do the rest for you. The CMake code is very clean, but uses the older 2.x style.
